{
  "users": [
    {
      "name": "Артем",
      "last_name": "Михеев",
      "email": "artem@mail.ru",
      "password": "123123",
      "role_id": 1,
      "id": 1
    },
    {
      "name": "Иван",
      "last_name": "Иванов",
      "email": "user@mail.ru",
      "password": "123123",
      "role_id": 2,
      "id": 2
    },
    {
      "name": "Александр",
      "last_name": "Петров",
      "email": "writer1@mail.ru",
      "password": "123123",
      "role_id": 1,
      "id": 3
    },
    {
      "name": "Светлана",
      "last_name": "Бондаренко",
      "email": "writer2@mail.ru",
      "password": "123123",
      "role_id": 1,
      "id": 4
    },
    {
      "name": "Петр",
      "last_name": "Сидоров",
      "email": "reader1@mail.ru",
      "password": "123123",
      "role_id": 2,
      "id": 5
    },
    {
      "name": "Денис",
      "last_name": "Костяной",
      "email": "denis@mail.ru",
      "password": "123123",
      "role_id": 1,
      "id": 6
    }
  ],
  "posts": [
    {
      "title": "Vue js",
      "content": "JavaScript-фреймворк с открытым исходным кодом для создания пользовательских интерфейсов. Легко интегрируется в проекты с использованием других JavaScript-библиотек. Может функционировать как веб-фреймворк для разработки одностраничных приложений в реактивном стиле.",
      "like": 112,
      "user_id": 2,
      "created_at": "2021-04-07T20:28:59.876Z",
      "update_at": "2021-04-07T20:28:59.876Z",
      "id": 2
    },
    {
      "title": "Чосер, Джефри",
      "content": "Отец Чосера, виноторговец, поставлял вино ко двору короля, благодаря чему и сын его попал довольно рано (17 лет) ко двору в качестве пажа Елизаветы, жены Лионеля, сына Эдуарда III. В 1359 году он принимал участие в походе против Франции, во время которого был взят в плен. Король выкупил его за 16 фунтов и, по возвращении его в Англию, сделал его своим камердинером, а впоследствии и оруженосцем. В это время он уже довольно основательно изучил доступных ему писателей и пробовал писать сам; между прочим, он воспевал в стихах свою любовь к одной неизвестной даме, которая не отвечала взаимностью на его страсть.",
      "like": 1,
      "user_id": 3,
      "created_at": "2021-04-08T17:36:19.281Z",
      "update_at": "2021-04-08T17:36:19.281Z",
      "id": 3
    },
    {
      "title": "Гёте, Иоганн Вольфганг фон",
      "content": "ёте творил в разных жанрах: поэзия, драма, эпос, автобиография, эпистолярия и др. Гёте стал главным идеологом течения «Буря и натиск». Вместе с Шиллером, Гердером и Виландом сформировал направление в немецкой литературе, получившее название «веймарский классицизм». Роман Гёте «Вильгельм Майстер» заложил основы воспитательного романа эпохи Просвещения. Произведения Гёте, в особенности трагедия «Фауст», признаны шедеврами немецкой и мировой литературы.",
      "like": 2,
      "user_id": 3,
      "created_at": "2021-04-08T17:36:51.801Z",
      "update_at": "2021-04-08T17:36:51.801Z",
      "id": 4
    },
    {
      "title": "Гомер",
      "content": "Ясно, однако, что «Илиада» и «Одиссея» были созданы значительно позже описываемых в них событий, раньше VI века до н. э., когда достоверно зафиксировано их существование. Хронологический период, в котором локализует жизнь Гомера современная наука, — приблизительно VIII век до н. э. По словам Геродота, Гомер жил за 400 лет до него[5], что указывает на дату 850 лет до н. э. Неизвестный историк в своих записках указывает, что Гомер жил за 622 года до Ксеркса, что указывает на 1102 год до н. э. Другие древние источники говорят, что он жил во времена Троянской войны[6]. На данный момент существует несколько дат рождения и доказательств к ним.",
      "like": 0,
      "user_id": 4,
      "created_at": "2021-04-08T17:37:58.202Z",
      "update_at": "2021-04-08T17:37:58.202Z",
      "id": 5
    },
    {
      "title": "Джойс, Джеймс",
      "content": "Джеймс Джойс родился в Ратгаре, застроенном георгианскими домами районе в южной части Дублина, в большой семье Джона Станисласа Джойса и Мэри Джейн Марри. Неудачное ведение дел почти разорило его отца, который вынужден был неоднократно менять профессию. Семья несколько раз переезжала из одного района Дублина в другой. Джеймсу удалось получить неплохое образование, однако нищета и неустроенность его жизни в юности навсегда остались в его памяти, что отчасти нашло отражение в его произведениях. Сам Джойс часто проводил биографические аналогии с главным героем некоторых его работ и одним из главных персонажей его романов «Портрет художника в юности» и «Улисс» Стивеном Дедалом.",
      "like": 0,
      "user_id": 4,
      "created_at": "2021-04-08T17:38:24.801Z",
      "update_at": "2021-04-08T17:38:24.801Z",
      "id": 6
    },
    {
      "title": "Достоевский, Фёдор Михайлович",
      "content": "Фёдор Миха́йлович Достое́вский (30 октября [11 ноября] 1821, Москва, Российская империя — 28 января [9 февраля] 1881, Санкт-Петербург, Российская империя) — русский писатель, мыслитель, философ и публицист[10]. Член-корреспондент Петербургской академии наук с 1877 года[11]. Классик мировой литературы.\n\nРанние произведения писателя, как и повесть «Записки из Мёртвого дома», способствовали возникновению жанра психологической прозы[12].\n\nПосле смерти Достоевский был признан классиком русской литературы и одним из лучших романистов мирового значения, считается первым представителем персонализма в России. Творчество русского писателя оказало воздействие на мировую литературу, в частности на творчество ряда лауреатов Нобелевской премии по литературе, философов Фридриха Ницше и Жана-Поль Сартра, а также на становление экзистенциализма и фрейдизма[13].\n\nК наиболее значительным произведениям писателя относятся романы «великого пятикнижия». Многие известные произведения Достоевского многократно экранизировались и инсценировались в театре, ставились балетные и оперные постановки.",
      "like": 0,
      "user_id": 4,
      "created_at": "2021-04-08T17:38:51.667Z",
      "update_at": "2021-04-08T17:38:51.667Z",
      "id": 7
    },
    {
      "title": "Пушкин, Александр Сергеевич",
      "content": "Происхождение Александра Сергеевича Пушкина идёт от разветвлённого нетитулованного дворянского рода Пушкиных, восходившего по генеалогической легенде к «мужу честну» Ратше[6][~ 3]. Пушкин неоднократно писал о своей родословной в стихах и прозе; он видел в своих предках образец истинной «аристократии», древнего рода, честно служившего отечеству, но не снискавшего благосклонности правителей и «гонимого». Не раз он обращался (в том числе в художественной форме) и к образу своего прадеда по матери — африканца Абрама Петровича Ганнибала, ставшего слугой и воспитанником Петра I, а потом военным инженером и генералом[8].",
      "like": 0,
      "user_id": 1,
      "created_at": "2021-04-08T17:39:41.771Z",
      "update_at": "2021-04-08T17:39:41.771Z",
      "id": 8
    },
    {
      "title": "Калидаса",
      "content": "Время и обстоятельства жизни Калидасы неизвестны. Не сохранилось ни одного документа той эпохи, касающегося поэта. Также отсутствуют упоминания о нём современников и потомков. Известны народные легенды о нём, однако информации, содержащейся в них, доверять невозможно. Единственным способом сделать какие-либо предположения о жизни Калидасы является историографический анализ его произведений, его языка и персонажей. Никаких фактических сведений об авторе его произведения не содержат. Сложность состоит также в том, что в целом существует очень мало исторических документов об Индии той эпохи, количество легенд намного превосходит количество достоверной информации.",
      "like": 0,
      "user_id": 1,
      "created_at": "2021-04-08T17:40:03.410Z",
      "update_at": "2021-04-08T17:40:03.410Z",
      "id": 9
    },
    {
      "title": "Шекспир, Уильям",
      "content": "Уи́льям Шекспи́р (англ. William Shakespeare[1], английское произношение: [ˌwɪljəm ˈʃeɪkspɪə(r)]; 26 апреля 1564 года (крещение)[⇨], Стратфорд-апон-Эйвон, Англия — 23 апреля (3 мая) 1616[⇨], там же) — английский поэт и драматург, зачастую считается величайшим англоязычным писателем и одним из лучших драматургов мира[2]. Часто именуется национальным поэтом Англии[3]. Дошедшие до нас работы, включая некоторые, написанные совместно с другими авторами, состоят из 38 пьес, 154 сонетов, 4 поэм и 3 эпитафий. Пьесы Шекспира переведены на все основные языки и ставятся чаще, чем произведения других драматургов[4].",
      "like": 0,
      "user_id": 1,
      "created_at": "2021-04-08T17:40:30.203Z",
      "update_at": "2021-04-08T17:40:30.203Z",
      "id": 10
    },
    {
      "title": "Гарсиа Маркес, Габриэль",
      "content": "абриэ́ль Хосе́ де ла Конко́рдиа «Гáбо» Гарси́а Ма́ркес[6][7] (исп. Gabriel José de la Concordia «Gabo» García Márquez [ɡaˈβɾjel ɡarˈsia ˈmarkes]; 6 марта 1927[8], Аракатака — 17 апреля 2014, Мехико[9]) — колумбийский писатель-прозаик, журналист, издатель и политический деятель. Лауреат Нейштадтской литературной премии (1972) и Нобелевской премии по литературе (1982). Представитель литературного направления «магический реализм».",
      "like": 0,
      "user_id": 1,
      "created_at": "2021-04-08T17:40:49.524Z",
      "update_at": "2021-04-09T11:14:17.386Z",
      "id": 11
    },
    {
      "title": "Диккенс, Чарльз",
      "content": "Чарльз Джон Ха́ффем Ди́ккенс (англ. Charles John Huffam Dickens [ˈtʃɑrlz ˈdɪkɪnz]; 7 февраля 1812 года, Портсмут, Англия — 9 июня 1870 года, Хайэм (англ.)русск., Англия) — английский писатель, стенограф, репортёр, романист и очеркист. Классик мировой литературы, один из крупнейших прозаиков XIX века, он стал самым популярным англоязычным писателем ещё при жизни. Творчество Диккенса относят к вершинам реализма, но в его романах отразились и сентиментальное, и сказочное начала. Самые знаменитые романы Диккенса: «Посмертные записки Пиквикского клуба», «Оливер Твист», «Николас Никльби», «Дэвид Копперфилд», «Холодный дом», «Повесть о двух городах», «Наш общий друг», «Большие надежды» «Тайна Эдвина Друда».",
      "like": 0,
      "user_id": 1,
      "created_at": "2021-04-08T17:41:05.932Z",
      "update_at": "2021-04-08T17:41:05.932Z",
      "id": 12
    },
    {
      "title": "Овидий",
      "content": "Пу́блий Ови́дий Назо́н (лат. Publius Ovidius Nasō) (20 марта 43 года до н. э., Сульмона — 17 или 18 год н. э., Томы) — древнеримский поэт. Более всего известен как автор поэм «Метаморфозы» и «Наука любви», а также элегий — «Любовные элегии» и «Скорбные элегии». По одной из версий, из-за несоответствия пропагандируемых им идеалов любви официальной политике императора Августа в отношении семьи и брака был сослан из Рима в западное Причерноморье, где провёл последние годы жизни. Оказал огромное влияние на европейскую литературу, в том числе на Пушкина, в 1821 году посвятившего ему обширное послание в стихах[7].",
      "like": 0,
      "user_id": 1,
      "created_at": "2021-04-08T17:41:25.572Z",
      "update_at": "2021-04-08T17:41:25.572Z",
      "id": 13
    },
    {
      "title": "Белорусы в России",
      "content": "Белорусы составляют значительную часть населения России. Согласно данным всероссийской переписи населения 2010 года, в стране проживает 521 443 человек, назвавших себя белорусами[1]. Значительное число белорусов проживает в следующих регионах: Москва, Санкт-Петербург, Калининград, Карелия.",
      "like": 2,
      "user_id": 6,
      "created_at": "2021-04-09T11:08:03.263Z",
      "update_at": "2021-04-09T11:08:03.263Z",
      "id": 15
    }
  ],
  "role": [
    {
      "id": 1,
      "title": "Писатель",
      "type": "writer"
    },
    {
      "id": 2,
      "title": "Читатель",
      "type": "reader"
    }
  ]
}